# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].


def main():
    seq = [7, 5, 3, 3, 2]

    while True:
        print(seq)
        number = input('Введите число. Для выхода введите не число ')
        if not number.isdigit():
            return
        number = int(number)
        i = 0
        while i < len(seq) and seq[i] > number:
            i += 1
        seq.insert(i, number)


if __name__ == '__main__':
    main()
